---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussShiftedReferences
source: html/3b989793-1ed9-3d70-e630-514123f57e7c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussShiftedReferences Property

Truss top and bottom references (chains of one or more reference lines) must overlap at least partially in the vertical direction.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussShiftedReferences { get; }
```